app/controllers/pointmaps_controller.rb

SELECT * FROM `pointmaps` WHERE (user_id = 20 OR public = 1)
---
  def index
    @pointmaps = Pointmap.find(:all, :conditions => ["user_id = ? OR public = ?", current_user.id, true])

SELECT * FROM `pointmaps` WHERE (`pointmaps`.`id` = 0)
---
  def show
    @pointmap = Pointmap.find(params[:id])